KISSY.add("components/area/zoneData",function (S) {
    var zone = {};
    var provinces = {
        8610 : { 
            name : '北京', 
            cities : [861010,86101001,86101002,86101003,86101004,86101005,86101006,86101007,86101008,86101009,86101010,86101011,86101012,86101013,86101014,86101015,86101016,86101017,86101018] 
        },
        8621 : { 
            name : '上海', 
            cities : [862121,86212101,86212102,86212103,86212104,86212105,86212106,86212107,86212108,86212109,86212110,86212111,86212112,86212113,86212114,86212115,86212116,86212117,86212118,86212119] 
        },
        8622 : { 
            name : '天津', 
            cities : [862222] 
        }, 
        8623 : { 
            name : '重庆', 
            cities : [862323,86232301,86232302,86232303,86232304,86232305,86232306,86232307,86232308,86232309,86232310,86232311,86232312,86232313,8623810,8623819,8623999,862399901,862399902,862399903,862399904,862399905,862399906,862399907,862399908,862399909,862399910,862399911,862399912,862399913,862399914,862399915,862399916,862399917,862399918,862399919,862399920,862399921,862399922,862399923,862399924,862399925] 
        },  
        8620 : { 
            name : '广东', 
            cities : [862020,8620660,8620661,8620662,8620663,8620668,8620750,8620751,8620752,8620753,8620754,8620755,8620756,8620757,8620758,8620759,8620760,8620762,8620763,8620765,8620766,8620768,8620769] 
        }, 
        
        8624 : { 
            name : '辽宁', 
            cities : [862424,8624410,862441001,8624411,862441101,862441102,8624412,862441201,8624413,8624414,8624415,8624416,8624417,8624418,8624419,8624421,862442101,8624427,8624429,862442901] 
        },
        8625 : { 
            name : '江苏', 
            cities : [862525,8625510,862551001,862551002,8625511,862551101,8625512,862551201,8625513,8625514,862551401,8625515,862551501,8625516,8625517,862551701,8625518,8625519,8625520,8625523,862552301,862552302,8625527] 
        }, 
        8627 : { 
            name : '湖北', 
            cities : [862727,8627710,862771001,8627711,8627712,862771201,862771202,8627713,862771301,862771302,8627714,8627715,862771501,8627716,862771601,8627717,862771701,8627718,862771801,8627719,862771901,8627722,8627724,8627728,862772801,862772802,862772803] 
        }, 
        8628 : { 
            name : '四川', 
            cities : [862828,8628812,8628813,8628816,8628817,8628818,8628825,8628826,862882601,8628827,8628830,8628831,8628832,862883201,8628833,862883301,8628834,8628835,8628836,8628837,8628838,8628839] 
        }, 
        8629 : { 
            name : '陕西', 
            cities : [862929,8629910,8629911,8629912,8629913,8629914,8629915,8629916,8629917,8629919] 
        }, 
        86311 : { 
            name : '河北', 
            cities : [86311310,86311311,8631131101,86311312,8631131201,8631131202,86311313,86311314,86311315,86311316,8631131601,86311317,8631131701,8631131702,86311318,86311319,8631131901,8631131902,86311335] 
        }, 
        86351 : { 
            name : '山西', 
            cities : [86351349,86351350,86351351,86351352,86351353,86351354,86351355,86351356,86351357,8635135701,86351358,86351359] 
        }, 
        86371 : { 
            name : '河南', 
            cities : [86371370,86371371,86371372,86371373,86371374,86371375,86371376,86371377,86371378,86371379,86371391,86371392,86371393,86371394,86371395,86371396,86371397,86371398,8637139801] 
        }, 
        86431 : { 
            name : '吉林', 
            cities : [86431431,86431432,8643143201,8643143202,86431433,8643143301,8643143302,8643143303,86431434,86431435,8643143501,86431436,8643143601,8643143602,86431437,86431438,8643143801,86431439,86431440,86431448] 
        }, 
        86451 : { 
            name : '黑龙江', 
            cities : [86451450,86451451,8645145101,86451452,86451453,8645145301,86451454,8645145401,86451455,86451456,8645145601,8645145602,86451458,86451459,86451464,86451467,86451468,86451469] 
        }, 
        86471 : { 
            name : '内蒙古', 
            cities : [86471470,8647147001,8647147002,8647147003,86471471,86471472,86471473,86471474,86471475,8647147501,86471476,86471477,86471478,86471479,8647147901,86471482,86471483] 
        }, 
        86531 : { 
            name : '山东', 
            cities : [86531530,86531531,86531532,86531533,86531534,86531535,86531536,8653153601,8653153602,86531537,8653153701,86531538,8653153801,86531539,86531543,86531546,86531631,8653163101,86531632,8653163201,86531633,86531634,86531635,8653163501] 
        }, 
        86551 : { 
            name : '安徽', 
            cities : [86551550,86551551,86551552,86551553,86551554,86551555,86551556,86551557,86551558,8655155801,86551559,86551561,86551562,86551563,86551564,86551565,86551566] 
        }, 
        86571 : { 
            name : '浙江', 
            cities : [86571570,8657157001,86571571,8657157101,86571572,86571573,8657157301,86571574,8657157401,8657157602,8657157403,86571575,86571576,8657157601,86571577,8657157701,86571578,86571579,8657157901,8657157902,8657157903,86571580] 
        }, 
        86591 : {
            name : '福建',
            cities : [86591591,86591592,86591593,86591594,86591595,8659159501,86591596,86591597,86591598,8659159801,86591599,8659159901] 
        },
        86731 : { 
            name : '湖南', 
            cities : [86731730,8673173001,86731731,86731732,8673173201,86731733,86731734,8673173401,86731735,86731736,8673173601,86731737,86731738,8673173801,8673173802,86731739,86731743,86731744,86731745,8673174501,86731746,8673174601] 
        },
        86771 : { 
            name : '广西', 
            cities : [86771770,8677177001,86771771,8677177101,86771772,8677177201,86771773,86771774,8677177401,86771775,8677177501,86771776,86771777,86771778,8677177801,86771779] 
        },
        86791 : { 
            name : '江西', 
            cities : [86791701,86791790,86791791,86791792,8679179201,86791793,86791794,8679179401,86791795,86791796,8679179601,86791797,86791798,86791799] 
        }, 
        86851 : { 
            name : '贵州', 
            cities : [86851851,86851852,8685185201,86851853,86851854,86851855,86851856,86851857,86851858,86851859] 
        },
        86871 : { 
            name : '云南', 
            cities : [86871691,86871692,86871870,86871871,86871872,86871873,8687187301,8687187302,86871874,86871875,86871876,86871877,86871878,86871879,86871881,86871883,86871886,86871887,86871888] 
        },
        86891 : { 
            name : '西藏', 
            cities : [86891891,86891892,86891893,86891894,86891895,86891896,86891897] 
        }, 
        86898 : { 
            name : '海南', 
            cities : [86898890,86898898,8689889801,86898899] 
        }, 
        86931 : { 
            name : '甘肃', 
            cities : [86931930,86931931,86931932,86931933,86931934,8693193401,86931935,8693193501,86931936,86931937,8693193701,8693193702,86931938,86931939,86931943] 
        }, 
        86951 : { 
            name : '宁夏', 
            cities : [86951951,86951952,8695195201,86951953,86951954]
        }, 
        86971 : { 
            name : '青海', 
            cities : [86971970,86971971,86971972,86971973,86971974,86971975,86971976,86971977,86971978,86971979] 
        }, 
        86991 : { 
            name : '新疆', 
            cities : [86991901,86991902,86991903,86991906,86991908,86991909,86991990,86991991,86991992,86991993,86991994,86991995,86991996,86991997,86991998,86991999] 
        }, 
        85210 : { 
            name : '香港', 
            cities : [8521010] 
        }, 
        85310 : { 
            name : '澳门', 
            cities : [8531010] 
        }, 
        88610 : { 
            name : '台湾', 
            cities : [8861010] 
        },
        1607 : { 
            name : '国外', 
            cities : [1607607]
        } 
    };
    var cities = {
        861010 : { 
            name : '北京', 
            province : 8610 
        }, 
        862020 : { 
            name : '广州', 
            province : 8620 
        }, 
        862121 : { 
            name : '上海', 
            province : 8621 
        }, 
        862222 : { 
            name : '天津', 
            province : 8622 
        }, 
        862323 : { 
            name : '重庆', 
            province : 8623 
        }, 
        862424 : { 
            name : '沈阳', 
            province : 8624 
        }, 
        862525 : { 
            name : '南京', 
            province : 8625 
        }, 
        862727 : { 
            name : '武汉', 
            province : 8627 
        }, 
        862828 : { 
            name : '成都', 
            province : 8628 
        }, 
        862929 : { 
            name : '西安', 
            province : 8629 
        }, 
        1607607 : { 
            name : '国外', 
            province : 1607 
        }, 
        8521010 : { 
            name : '香港', 
            province : 85210 
        }, 
        8531010 : { 
            name : '澳门', 
            province : 85310 
        }, 
        8620660 : { 
            name : '汕尾', 
            province : 8620 
        }, 
        8620661 : { 
            name : '潮阳', 
            province : 8620 
        }, 
        8620662 : { 
            name : '阳江', 
            province : 8620 
        }, 
        8620663 : { 
            name : '揭阳', 
            province : 8620 
        }, 
        8620668 : { 
            name : '茂名', 
            province : 8620 
        }, 
        8620750 : { 
            name : '江门', 
            province : 8620 
        }, 
        8620751 : { 
            name : '韶关', 
            province : 8620 
        }, 
        8620752 : { 
            name : '惠州', 
            province : 8620 
        }, 
        8620753 : { 
            name : '梅州', 
            province : 8620 
        }, 
        8620754 : { 
            name : '汕头', 
            province : 8620 
        }, 
        8620755 : { 
            name : '深圳', 
            province : 8620 
        }, 
        8620756 : { 
            name : '珠海', 
            province : 8620 
        }, 
        8620757 : { 
            name : '佛山', 
            province : 8620 
        }, 
        8620758 : { 
            name : '肇庆', 
            province : 8620 
        }, 
        8620759 : { 
            name : '湛江', 
            province : 8620 
        }, 
        8620760 : { 
            name : '中山', 
            province : 8620 
        }, 
        8620762 : { 
            name : '河源', 
            province : 8620 
        }, 
        8620763 : { 
            name : '清远', 
            province : 8620 
        }, 
        8620765 : { 
            name : '顺德', 
            province : 8620 
        }, 
        8620766 : { 
            name : '云浮', 
            province : 8620 
        }, 
        8620768 : { 
            name : '潮州', 
            province : 8620 
        }, 
        8620769 : { 
            name : '东莞', 
            province : 8620 
        }, 
        8623810 : { 
            name : '涪陵', 
            province : 8623 
        }, 
        8623819 : { 
            name : '万县', 
            province : 8623 
        }, 
        8623999 : { 
            name : '重庆其它地区', 
            province : 8623 
        }, 
        8624410 : { 
            name : '铁岭', 
            province : 8624 
        }, 
        8624411 : { 
            name : '大连', 
            province : 8624 
        }, 
        8624412 : { 
            name : '鞍山', 
            province : 8624 
        }, 
        8624413 : { 
            name : '抚顺', 
            province : 8624 
        }, 
        8624414 : { 
            name : '本溪', 
            province : 8624 
        }, 
        8624415 : { 
            name : '丹东', 
            province : 8624 
        }, 
        8624416 : { 
            name : '锦州', 
            province : 8624 
        }, 
        8624417 : { 
            name : '营口', 
            province : 8624 
        }, 
        8624418 : { 
            name : '阜新', 
            province : 8624 
        }, 
        8624419 : { 
            name : '辽阳', 
            province : 8624 
        }, 
        8624421 : { 
            name : '朝阳', 
            province : 8624 
        }, 
        8624427 : { 
            name : '盘锦', 
            province : 8624 
        }, 
        8624429 : { 
            name : '葫芦岛', 
            province : 8624 
        }, 
        8625510 : { 
            name : '无锡', 
            province : 8625 
        }, 
        8625511 : { 
            name : '镇江', 
            province : 8625 
        }, 
        8625512 : { 
            name : '苏州', 
            province : 8625 
        }, 
        8625513 : { 
            name : '南通', 
            province : 8625 
        }, 
        8625514 : { 
            name : '扬州', 
            province : 8625 
        }, 
        8625515 : { 
            name : '盐城', 
            province : 8625 
        }, 
        8625516 : { 
            name : '徐州', 
            province : 8625 
        }, 
        8625517 : { 
            name : '淮安', 
            province : 8625 
        }, 
        8625518 : { 
            name : '连云港', 
            province : 8625 
        }, 
        8625519 : { 
            name : '常州', 
            province : 8625 
        }, 
        8625520 : { 
            name : '常熟', 
            province : 8625 
        }, 
        8625523 : { 
            name : '泰州', 
            province : 8625 
        }, 
        8625527 : { 
            name : '宿迁', 
            province : 8625 
        }, 
        8627710 : { 
            name : '襄樊', 
            province : 8627 
        }, 
        8627711 : { 
            name : '鄂州', 
            province : 8627 
        }, 
        8627712 : { 
            name : '孝感', 
            province : 8627 
        }, 
        8627713 : { 
            name : '黄冈', 
            province : 8627 
        }, 
        8627714 : { 
            name : '黄石', 
            province : 8627 
        }, 
        8627715 : { 
            name : '咸宁', 
            province : 8627 
        }, 
        8627716 : { 
            name : '荆州', 
            province : 8627 
        }, 
        8627717 : { 
            name : '宜昌', 
            province : 8627 
        }, 
        8627718 : { 
            name : '恩施', 
            province : 8627 
        }, 
        8627719 : { 
            name : '十堰', 
            province : 8627 
        }, 
        8627722 : { 
            name : '随州', 
            province : 8627 
        }, 
        8627724 : { 
            name : '荆门', 
            province : 8627 
        }, 
        8627728 : { 
            name : '仙桃', 
            province : 8627 
        }, 
        8628812 : { 
            name : '攀枝花', 
            province : 8628 
        }, 
        8628813 : { 
            name : '自贡', 
            province : 8628 
        }, 
        8628816 : { 
            name : '绵阳', 
            province : 8628 
        }, 
        8628817 : { 
            name : '南充', 
            province : 8628 
        }, 
        8628818 : { 
            name : '达州', 
            province : 8628 
        }, 
        8628825 : { 
            name : '遂宁', 
            province : 8628 
        }, 
        8628826 : { 
            name : '广安', 
            province : 8628 
        }, 
        8628827 : { 
            name : '巴中', 
            province : 8628 
        }, 
        8628830 : { 
            name : '泸州', 
            province : 8628 
        }, 
        8628831 : { 
            name : '宜宾', 
            province : 8628 
        }, 
        8628832 : { 
            name : '资阳', 
            province : 8628 
        }, 
        8628833 : { 
            name : '乐山', 
            province : 8628 
        }, 
        8628834 : { 
            name : '西昌', 
            province : 8628 
        }, 
        8628835 : { 
            name : '雅安', 
            province : 8628 
        }, 
        8628836 : { 
            name : '甘孜州', 
            province : 8628 
        }, 
        8628837 : { 
            name : '马尔康', 
            province : 8628 
        }, 
        8628838 : { 
            name : '德阳', 
            province : 8628 
        }, 
        8628839 : { 
            name : '广元', 
            province : 8628 
        }, 
        8629910 : { 
            name : '咸阳', 
            province : 8629 
        }, 
        8629911 : { 
            name : '延安', 
            province : 8629 
        }, 
        8629912 : { 
            name : '榆林', 
            province : 8629 
        }, 
        8629913 : { 
            name : '渭南', 
            province : 8629 
        }, 
        8629914 : { 
            name : '商洛', 
            province : 8629 
        }, 
        8629915 : { 
            name : '安康', 
            province : 8629 
        }, 
        8629916 : { 
            name : '汉中', 
            province : 8629 
        }, 
        8629917 : { 
            name : '宝鸡', 
            province : 8629 
        }, 
        8629919 : { 
            name : '铜川', 
            province : 8629 
        }, 
        8861010 : { 
            name : '台湾', 
            province : 88610 
        }, 
        86101001 : { 
            name : '东城区', 
            province : 8610 
        }, 
        86101002 : { 
            name : '西城区', 
            province : 8610 
        }, 
        86101003 : { 
            name : '崇文区', 
            province : 8610 
        }, 
        86101004 : { 
            name : '宣武区', 
            province : 8610 
        }, 
        86101005 : { 
            name : '朝阳区', 
            province : 8610 
        }, 
        86101006 : { 
            name : '海淀区', 
            province : 8610 
        }, 
        86101007 : { 
            name : '丰台区', 
            province : 8610 
        }, 
        86101008 : { 
            name : '石景山区', 
            province : 8610 
        }, 
        86101009 : { 
            name : '顺义区', 
            province : 8610 
        }, 
        86101010 : { 
            name : '昌平区', 
            province : 8610 
        }, 
        86101011 : { 
            name : '门头沟区', 
            province : 8610 
        }, 
        86101012 : { 
            name : '通州区', 
            province : 8610 
        }, 
        86101013 : { 
            name : '房山区', 
            province : 8610 
        }, 
        86101014 : { 
            name : '大兴区', 
            province : 8610 
        }, 
        86101015 : { 
            name : '延庆县', 
            province : 8610 
        }, 
        86101016 : { 
            name : '怀柔区', 
            province : 8610 
        }, 
        86101017 : { 
            name : '平谷区', 
            province : 8610 
        }, 
        86101018 : { 
            name : '密云县', 
            province : 8610 
        }, 
        86212101 : { 
            name : '黄浦区', 
            province : 8621 
        }, 
        86212102 : { 
            name : '闸北区', 
            province : 8621 
        }, 
        86212103 : { 
            name : '静安区', 
            province : 8621 
        }, 
        86212104 : { 
            name : '徐汇区', 
            province : 8621 
        }, 
        86212105 : { 
            name : '长宁区', 
            province : 8621 
        }, 
        86212106 : { 
            name : '闵行区', 
            province : 8621 
        }, 
        86212107 : { 
            name : '浦东区', 
            province : 8621 
        }, 
        86212108 : { 
            name : '宝山区', 
            province : 8621 
        }, 
        86212109 : { 
            name : '嘉定区', 
            province : 8621 
        }, 
        86212110 : { 
            name : '卢湾区', 
            province : 8621 
        }, 
        86212111 : { 
            name : '青浦区', 
            province : 8621 
        }, 
        86212112 : { 
            name : '松江区', 
            province : 8621 
        }, 
        86212113 : { 
            name : '金山区', 
            province : 8621 
        }, 
        86212114 : { 
            name : '奉贤区', 
            province : 8621 
        }, 
        86212115 : { 
            name : '杨浦区', 
            province : 8621 
        }, 
        86212116 : { 
            name : '虹口区', 
            province : 8621 
        }, 
        86212117 : { 
            name : '南汇区', 
            province : 8621 
        }, 
        86212118 : { 
            name : '普陀区', 
            province : 8621 
        }, 
        86212119 : { 
            name : '崇明县', 
            province : 8621 
        }, 
        86232301 : { 
            name : '沙坪坝区', 
            province : 8623 
        }, 
        86232302 : { 
            name : '渝中区', 
            province : 8623 
        }, 
        86232303 : { 
            name : '大渡口区', 
            province : 8623 
        }, 
        86232304 : { 
            name : '北碚区', 
            province : 8623 
        }, 
        86232305 : { 
            name : '江北区', 
            province : 8623 
        }, 
        86232306 : { 
            name : '南岸区', 
            province : 8623 
        }, 
        86232307 : { 
            name : '九龙坡区', 
            province : 8623 
        }, 
        86232308 : { 
            name : '渝北区', 
            province : 8623 
        }, 
        86232309 : { 
            name : '巴南区', 
            province : 8623 
        }, 
        86232310 : { 
            name : '长寿区', 
            province : 8623 
        }, 
        86232311 : { 
            name : '黔江区', 
            province : 8623 
        }, 
        86232312 : { 
            name : '双桥区', 
            province : 8623 
        }, 
        86232313 : { 
            name : '万盛区', 
            province : 8623 
        }, 
        86311310 : { 
            name : '邯郸', 
            province : 86311 
        }, 
        86311311 : { 
            name : '石家庄', 
            province : 86311 
        }, 
        86311312 : { 
            name : '保定', 
            province : 86311 
        }, 
        86311313 : { 
            name : '张家口', 
            province : 86311 
        }, 
        86311314 : { 
            name : '承德', 
            province : 86311 
        }, 
        86311315 : { 
            name : '唐山', 
            province : 86311 
        }, 
        86311316 : { 
            name : '廊坊', 
            province : 86311 
        }, 
        86311317 : { 
            name : '沧州', 
            province : 86311 
        }, 
        86311318 : { 
            name : '衡水', 
            province : 86311 
        }, 
        86311319 : { 
            name : '邢台', 
            province : 86311 
        }, 
        86311335 : { 
            name : '秦皇岛', 
            province : 86311 
        }, 
        86351349 : { 
            name : '朔州', 
            province : 86351 
        }, 
        86351350 : { 
            name : '忻州', 
            province : 86351 
        }, 
        86351351 : { 
            name : '太原', 
            province : 86351 
        }, 
        86351352 : { 
            name : '大同', 
            province : 86351 
        }, 
        86351353 : { 
            name : '阳泉', 
            province : 86351 
        }, 
        86351354 : { 
            name : '榆次', 
            province : 86351 
        }, 
        86351355 : { 
            name : '长治', 
            province : 86351 
        }, 
        86351356 : { 
            name : '晋城', 
            province : 86351 
        }, 
        86351357 : { 
            name : '临汾', 
            province : 86351 
        }, 
        86351358 : { 
            name : '离石', 
            province : 86351 
        }, 
        86351359 : { 
            name : '运城', 
            province : 86351 
        }, 
        86371370 : { 
            name : '商丘', 
            province : 86371 
        }, 
        86371371 : { 
            name : '郑州', 
            province : 86371 
        }, 
        86371372 : { 
            name : '安阳', 
            province : 86371 
        }, 
        86371373 : { 
            name : '新乡', 
            province : 86371 
        }, 
        86371374 : { 
            name : '许昌', 
            province : 86371 
        }, 
        86371375 : { 
            name : '平顶山', 
            province : 86371 
        }, 
        86371376 : { 
            name : '信阳', 
            province : 86371 
        }, 
        86371377 : { 
            name : '南阳', 
            province : 86371 
        }, 
        86371378 : { 
            name : '开封', 
            province : 86371 
        }, 
        86371379 : { 
            name : '洛阳', 
            province : 86371 
        }, 
        86371391 : { 
            name : '焦作', 
            province : 86371 
        }, 
        86371392 : { 
            name : '鹤壁', 
            province : 86371 
        }, 
        86371393 : { 
            name : '濮阳', 
            province : 86371 
        }, 
        86371394 : { 
            name : '周口', 
            province : 86371 
        }, 
        86371395 : { 
            name : '漯河', 
            province : 86371 
        }, 
        86371396 : { 
            name : '驻马店', 
            province : 86371 
        }, 
        86371397 : { 
            name : '潢川', 
            province : 86371 
        }, 
        86371398 : { 
            name : '三门峡', 
            province : 86371 
        }, 
        86431431 : { 
            name : '长春', 
            province : 86431 
        }, 
        86431432 : { 
            name : '吉林', 
            province : 86431 
        }, 
        86431433 : { 
            name : '延边自治州', 
            province : 86431 
        }, 
        86431434 : { 
            name : '四平', 
            province : 86431 
        }, 
        86431435 : { 
            name : '通化', 
            province : 86431 
        }, 
        86431436 : { 
            name : '白城', 
            province : 86431 
        }, 
        86431437 : { 
            name : '辽源', 
            province : 86431 
        }, 
        86431438 : { 
            name : '松原', 
            province : 86431 
        }, 
        86431439 : { 
            name : '白山', 
            province : 86431 
        }, 
        86431440 : { 
            name : '珲春', 
            province : 86431 
        }, 
        86431448 : { 
            name : '梅河口', 
            province : 86431 
        }, 
        86451450 : { 
            name : '阿城', 
            province : 86451 
        }, 
        86451451 : { 
            name : '哈尔滨', 
            province : 86451 
        }, 
        86451452 : { 
            name : '齐齐哈尔', 
            province : 86451 
        }, 
        86451453 : { 
            name : '牡丹江', 
            province : 86451 
        }, 
        86451454 : { 
            name : '佳木斯', 
            province : 86451 
        }, 
        86451455 : { 
            name : '绥化', 
            province : 86451 
        }, 
        86451456 : { 
            name : '黑河', 
            province : 86451 
        }, 
        86451458 : { 
            name : '伊春', 
            province : 86451 
        }, 
        86451459 : { 
            name : '大庆', 
            province : 86451 
        }, 
        86451464 : { 
            name : '七台河', 
            province : 86451 
        }, 
        86451467 : { 
            name : '鸡西', 
            province : 86451 
        }, 
        86451468 : { 
            name : '鹤岗', 
            province : 86451 
        }, 
        86451469 : { 
            name : '双鸭山', 
            province : 86451 
        }, 
        86471470 : { 
            name : '海拉尔', 
            province : 86471 
        }, 
        86471471 : { 
            name : '呼和浩特', 
            province : 86471 
        }, 
        86471472 : { 
            name : '包头', 
            province : 86471 
        }, 
        86471473 : { 
            name : '乌海', 
            province : 86471 
        }, 
        86471474 : { 
            name : '集宁', 
            province : 86471 
        }, 
        86471475 : { 
            name : '通辽', 
            province : 86471 
        }, 
        86471476 : { 
            name : '赤峰', 
            province : 86471 
        }, 
        86471477 : { 
            name : '东胜', 
            province : 86471 
        }, 
        86471478 : { 
            name : '临河', 
            province : 86471 
        }, 
        86471479 : { 
            name : '锡林浩特', 
            province : 86471 
        }, 
        86471482 : { 
            name : '乌兰浩特', 
            province : 86471 
        }, 
        86471483 : { 
            name : '巴彦浩特', 
            province : 86471 
        }, 
        86531530 : { 
            name : '菏泽', 
            province : 86531 
        }, 
        86531531 : { 
            name : '济南', 
            province : 86531 
        }, 
        86531532 : { 
            name : '青岛', 
            province : 86531 
        }, 
        86531533 : { 
            name : '淄博', 
            province : 86531 
        }, 
        86531534 : { 
            name : '德州', 
            province : 86531 
        }, 
        86531535 : { 
            name : '烟台', 
            province : 86531 
        }, 
        86531536 : { 
            name : '潍坊', 
            province : 86531 
        }, 
        86531537 : { 
            name : '济宁', 
            province : 86531 
        }, 
        86531538 : { 
            name : '泰安', 
            province : 86531 
        }, 
        86531539 : { 
            name : '临沂', 
            province : 86531 
        }, 
        86531543 : { 
            name : '滨州', 
            province : 86531 
        }, 
        86531546 : { 
            name : '东营', 
            province : 86531 
        }, 
        86531631 : { 
            name : '威海', 
            province : 86531 
        }, 
        86531632 : { 
            name : '枣庄', 
            province : 86531 
        }, 
        86531633 : { 
            name : '日照', 
            province : 86531 
        }, 
        86531634 : { 
            name : '莱芜', 
            province : 86531 
        }, 
        86531635 : { 
            name : '聊城', 
            province : 86531 
        }, 
        86551550 : { 
            name : '滁州', 
            province : 86551 
        }, 
        86551551 : { 
            name : '合肥', 
            province : 86551 
        }, 
        86551552 : { 
            name : '蚌埠', 
            province : 86551 
        }, 
        86551553 : { 
            name : '芜湖', 
            province : 86551 
        }, 
        86551554 : { 
            name : '淮南', 
            province : 86551 
        }, 
        86551555 : { 
            name : '马鞍山', 
            province : 86551 
        }, 
        86551556 : { 
            name : '安庆', 
            province : 86551 
        }, 
        86551557 : { 
            name : '宿州', 
            province : 86551 
        }, 
        86551558 : { 
            name : '阜阳', 
            province : 86551 
        }, 
        86551559 : { 
            name : '黄山', 
            province : 86551 
        }, 
        86551561 : { 
            name : '淮北', 
            province : 86551 
        }, 
        86551562 : { 
            name : '铜陵', 
            province : 86551 
        }, 
        86551563 : { 
            name : '宣城', 
            province : 86551 
        }, 
        86551564 : { 
            name : '六安', 
            province : 86551 
        }, 
        86551565 : { 
            name : '巢湖', 
            province : 86551 
        }, 
        86551566 : { 
            name : '池州', 
            province : 86551 
        }, 
        86571570 : { 
            name : '衢州', 
            province : 86571 
        }, 
        86571571 : { 
            name : '杭州', 
            province : 86571 
        }, 
        86571572 : { 
            name : '湖州', 
            province : 86571 
        }, 
        86571573 : { 
            name : '嘉兴', 
            province : 86571 
        }, 
        86571574 : { 
            name : '宁波', 
            province : 86571 
        }, 
        86571575 : { 
            name : '绍兴', 
            province : 86571 
        }, 
        86571576 : { 
            name : '台州', 
            province : 86571 
        }, 
        86571577 : { 
            name : '温州', 
            province : 86571 
        }, 
        86571578 : { 
            name : '丽水', 
            province : 86571 
        }, 
        86571579 : { 
            name : '金华', 
            province : 86571 
        }, 
        86571580 : { 
            name : '舟山', 
            province : 86571 
        }, 
        86591591 : { 
            name : '福州', 
            province : 86591 
        }, 
        86591592 : { 
            name : '厦门', 
            province : 86591 
        }, 
        86591593 : { 
            name : '宁德', 
            province : 86591 
        }, 
        86591594 : { 
            name : '莆田', 
            province : 86591 
        }, 
        86591595 : { 
            name : '泉州', 
            province : 86591 
        }, 
        86591596 : { 
            name : '漳州', 
            province : 86591 
        }, 
        86591597 : { 
            name : '龙岩', 
            province : 86591 
        }, 
        86591598 : { 
            name : '三明', 
            province : 86591 
        }, 
        86591599 : { 
            name : '南平', 
            province : 86591 
        }, 
        86731730 : { 
            name : '岳阳', 
            province : 86731 
        }, 
        86731731 : { 
            name : '长沙', 
            province : 86731 
        }, 
        86731732 : { 
            name : '湘潭', 
            province : 86731 
        }, 
        86731733 : { 
            name : '株洲', 
            province : 86731 
        }, 
        86731734 : { 
            name : '衡阳', 
            province : 86731 
        }, 
        86731735 : { 
            name : '郴州', 
            province : 86731 
        }, 
        86731736 : { 
            name : '常德', 
            province : 86731 
        }, 
        86731737 : { 
            name : '益阳', 
            province : 86731 
        }, 
        86731738 : { 
            name : '娄底', 
            province : 86731 
        }, 
        86731739 : { 
            name : '邵阳', 
            province : 86731 
        }, 
        86731743 : { 
            name : '吉首', 
            province : 86731 
        }, 
        86731744 : { 
            name : '张家界', 
            province : 86731 
        }, 
        86731745 : { 
            name : '怀化', 
            province : 86731 
        }, 
        86731746 : { 
            name : '永州', 
            province : 86731 
        }, 
        86771770 : { 
            name : '防城港', 
            province : 86771 
        }, 
        86771771 : { 
            name : '南宁', 
            province : 86771 
        }, 
        86771772 : { 
            name : '柳州', 
            province : 86771 
        }, 
        86771773 : { 
            name : '桂林', 
            province : 86771 
        }, 
        86771774 : { 
            name : '梧州', 
            province : 86771 
        }, 
        86771775 : { 
            name : '玉林', 
            province : 86771 
        }, 
        86771776 : { 
            name : '百色', 
            province : 86771 
        }, 
        86771777 : { 
            name : '钦州', 
            province : 86771 
        }, 
        86771778 : { 
            name : '河池', 
            province : 86771 
        }, 
        86771779 : { 
            name : '北海', 
            province : 86771 
        }, 
        86791701 : { 
            name : '鹰潭', 
            province : 86791 
        }, 
        86791790 : { 
            name : '新余', 
            province : 86791 
        }, 
        86791791 : { 
            name : '南昌', 
            province : 86791 
        }, 
        86791792 : { 
            name : '九江', 
            province : 86791 
        }, 
        86791793 : { 
            name : '上饶', 
            province : 86791 
        }, 
        86791794 : { 
            name : '抚州', 
            province : 86791 
        }, 
        86791795 : { 
            name : '宜春', 
            province : 86791 
        }, 
        86791796 : { 
            name : '吉安', 
            province : 86791 
        }, 
        86791797 : { 
            name : '赣州', 
            province : 86791 
        }, 
        86791798 : { 
            name : '景德镇', 
            province : 86791 
        }, 
        86791799 : { 
            name : '萍乡', 
            province : 86791 
        }, 
        86851851 : { 
            name : '贵阳', 
            province : 86851 
        }, 
        86851852 : { 
            name : '遵义', 
            province : 86851 
        }, 
        86851853 : { 
            name : '安顺', 
            province : 86851 
        }, 
        86851854 : { 
            name : '都匀', 
            province : 86851 
        }, 
        86851855 : { 
            name : '凯里', 
            province : 86851 
        }, 
        86851856 : { 
            name : '铜仁', 
            province : 86851 
        }, 
        86851857 : { 
            name : '毕节', 
            province : 86851 
        }, 
        86851858 : { 
            name : '六盘水', 
            province : 86851 
        }, 
        86851859 : { 
            name : '兴义', 
            province : 86851 
        }, 
        86871691 : { 
            name : '版纳', 
            province : 86871 
        }, 
        86871692 : { 
            name : '德宏', 
            province : 86871 
        }, 
        86871870 : { 
            name : '昭通', 
            province : 86871 
        }, 
        86871871 : { 
            name : '昆明', 
            province : 86871 
        }, 
        86871872 : { 
            name : '大理', 
            province : 86871 
        }, 
        86871873 : { 
            name : '个旧', 
            province : 86871 
        }, 
        86871874 : { 
            name : '曲靖', 
            province : 86871 
        }, 
        86871875 : { 
            name : '保山', 
            province : 86871 
        }, 
        86871876 : { 
            name : '文山', 
            province : 86871 
        }, 
        86871877 : { 
            name : '玉溪', 
            province : 86871 
        }, 
        86871878 : { 
            name : '楚雄', 
            province : 86871 
        }, 
        86871879 : { 
            name : '思茅', 
            province : 86871 
        }, 
        86871881 : { 
            name : '东川', 
            province : 86871 
        }, 
        86871883 : { 
            name : '临沧', 
            province : 86871 
        }, 
        86871886 : { 
            name : '六库', 
            province : 86871 
        }, 
        86871887 : { 
            name : '中甸', 
            province : 86871 
        }, 
        86871888 : { 
            name : '丽江', 
            province : 86871 
        }, 
        86891891 : { 
            name : '拉萨', 
            province : 86891 
        }, 
        86891892 : { 
            name : '日喀则', 
            province : 86891 
        }, 
        86891893 : { 
            name : '山南', 
            province : 86891 
        }, 
        86891894 : { 
            name : '林芝', 
            province : 86891 
        }, 
        86891895 : { 
            name : '昌都', 
            province : 86891 
        }, 
        86891896 : { 
            name : '那曲', 
            province : 86891 
        }, 
        86891897 : { 
            name : '阿里', 
            province : 86891 
        }, 
        86898890 : { 
            name : '儋州', 
            province : 86898 
        }, 
        86898898 : { 
            name : '海口', 
            province : 86898 
        }, 
        86898899 : { 
            name : '三亚', 
            province : 86898 
        }, 
        86931930 : { 
            name : '临夏', 
            province : 86931 
        }, 
        86931931 : { 
            name : '兰州', 
            province : 86931 
        }, 
        86931932 : { 
            name : '定西', 
            province : 86931 
        }, 
        86931933 : { 
            name : '平凉', 
            province : 86931 
        }, 
        86931934 : { 
            name : '庆阳', 
            province : 86931 
        }, 
        86931935 : { 
            name : '金昌', 
            province : 86931 
        }, 
        86931936 : { 
            name : '张掖', 
            province : 86931 
        }, 
        86931937 : { 
            name : '酒泉', 
            province : 86931 
        }, 
        86931938 : { 
            name : '天水', 
            province : 86931 
        }, 
        86931939 : { 
            name : '陇南', 
            province : 86931 
        }, 
        86931943 : { 
            name : '白银', 
            province : 86931 
        }, 
        86951951 : { 
            name : '银川', 
            province : 86951 
        }, 
        86951952 : { 
            name : '石嘴山', 
            province : 86951 
        }, 
        86951953 : { 
            name : '吴忠', 
            province : 86951 
        }, 
        86951954 : { 
            name : '固原', 
            province : 86951 
        }, 
        86971970 : { 
            name : '海晏', 
            province : 86971 
        }, 
        86971971 : { 
            name : '西宁', 
            province : 86971 
        }, 
        86971972 : { 
            name : '海东', 
            province : 86971 
        }, 
        86971973 : { 
            name : '同仁', 
            province : 86971 
        }, 
        86971974 : { 
            name : '共和', 
            province : 86971 
        }, 
        86971975 : { 
            name : '玛沁', 
            province : 86971 
        }, 
        86971976 : { 
            name : '玉树', 
            province : 86971 
        }, 
        86971977 : { 
            name : '德令哈', 
            province : 86971 
        }, 
        86971978 : { 
            name : '门源', 
            province : 86971 
        }, 
        86971979 : { 
            name : '格尔木', 
            province : 86971 
        }, 
        86991901 : { 
            name : '塔城', 
            province : 86991 
        }, 
        86991902 : { 
            name : '哈密', 
            province : 86991 
        }, 
        86991903 : { 
            name : '和田', 
            province : 86991 
        }, 
        86991906 : { 
            name : '阿勒泰', 
            province : 86991 
        }, 
        86991908 : { 
            name : '阿图什', 
            province : 86991 
        }, 
        86991909 : { 
            name : '博乐', 
            province : 86991 
        }, 
        86991990 : { 
            name : '克拉玛依', 
            province : 86991 
        }, 
        86991991 : { 
            name : '乌鲁木齐', 
            province : 86991 
        }, 
        86991992 : { 
            name : '奎屯', 
            province : 86991 
        }, 
        86991993 : { 
            name : '石河子', 
            province : 86991 
        }, 
        86991994 : { 
            name : '昌吉', 
            province : 86991 
        }, 
        86991995 : { 
            name : '吐鲁番', 
            province : 86991 
        }, 
        86991996 : { 
            name : '库尔勒', 
            province : 86991 
        }, 
        86991997 : { 
            name : '阿克苏', 
            province : 86991 
        }, 
        86991998 : { 
            name : '喀什', 
            province : 86991 
        }, 
        86991999 : { 
            name : '伊犁', 
            province : 86991 
        }, 
        862399901 : { 
            name : '永川', 
            province : 8623 
        }, 
        862399902 : { 
            name : '合川', 
            province : 8623 
        }, 
        862399903 : { 
            name : '江津', 
            province : 8623 
        }, 
        862399904 : { 
            name : '南川', 
            province : 8623 
        }, 
        862399905 : { 
            name : '綦江县', 
            province : 8623 
        }, 
        862399906 : { 
            name : '潼南县', 
            province : 8623 
        }, 
        862399907 : { 
            name : '荣昌县', 
            province : 8623 
        }, 
        862399908 : { 
            name : '壁山县', 
            province : 8623 
        }, 
        862399909 : { 
            name : '大足县', 
            province : 8623 
        }, 
        862399910 : { 
            name : '铜梁县', 
            province : 8623 
        }, 
        862399911 : { 
            name : '梁平县', 
            province : 8623 
        }, 
        862399912 : { 
            name : '城口县', 
            province : 8623 
        }, 
        862399913 : { 
            name : '垫江县', 
            province : 8623 
        }, 
        862399914 : { 
            name : '武隆县', 
            province : 8623 
        }, 
        862399915 : { 
            name : '丰都县', 
            province : 8623 
        }, 
        862399916 : { 
            name : '奉节县', 
            province : 8623 
        }, 
        862399917 : { 
            name : '开县', 
            province : 8623 
        }, 
        862399918 : { 
            name : '云阳县', 
            province : 8623 
        }, 
        862399919 : { 
            name : '忠县', 
            province : 8623 
        }, 
        862399920 : { 
            name : '巫溪县', 
            province : 8623 
        }, 
        862399921 : { 
            name : '巫山县', 
            province : 8623 
        }, 
        862399922 : { 
            name : '秀山县', 
            province : 8623 
        }, 
        862399923 : { 
            name : '石柱县', 
            province : 8623 
        }, 
        862399924 : { 
            name : '酉阳县', 
            province : 8623 
        }, 
        862399925 : { 
            name : '彭水县', 
            province : 8623 
        }, 
        862441001 : { 
            name : '铁法', 
            province : 8624 
        }, 
        862441101 : { 
            name : '瓦房店', 
            province : 8624 
        }, 
        862441102 : { 
            name : '长海', 
            province : 8624 
        }, 
        862441201 : { 
            name : '海城', 
            province : 8624 
        }, 
        862442101 : { 
            name : '北票', 
            province : 8624 
        }, 
        862442901 : { 
            name : '兴城', 
            province : 8624 
        }, 
        862551001 : { 
            name : '江阴', 
            province : 8625 
        }, 
        862551002 : { 
            name : '宜兴', 
            province : 8625 
        }, 
        862551101 : { 
            name : '丹阳', 
            province : 8625 
        }, 
        862551201 : { 
            name : '吴江', 
            province : 8625 
        }, 
        862551401 : { 
            name : '仪征', 
            province : 8625 
        }, 
        862551501 : { 
            name : '东台', 
            province : 8625 
        }, 
        862551701 : { 
            name : '淮阴', 
            province : 8625 
        }, 
        862552301 : { 
            name : '靖江', 
            province : 8625 
        }, 
        862552302 : { 
            name : '兴化', 
            province : 8625 
        }, 
        862771001 : { 
            name : '老河口', 
            province : 8627 
        }, 
        862771201 : { 
            name : '安陆', 
            province : 8627 
        }, 
        862771202 : { 
            name : '应城', 
            province : 8627 
        }, 
        862771301 : { 
            name : '武穴', 
            province : 8627 
        }, 
        862771302 : { 
            name : '麻城', 
            province : 8627 
        }, 
        862771501 : { 
            name : '蒲圻', 
            province : 8627 
        }, 
        862771601 : { 
            name : '石首', 
            province : 8627 
        }, 
        862771701 : { 
            name : '枝城', 
            province : 8627 
        }, 
        862771801 : { 
            name : '利川', 
            province : 8627 
        }, 
        862771901 : { 
            name : '丹江口', 
            province : 8627 
        }, 
        862772801 : { 
            name : '洪湖', 
            province : 8627 
        }, 
        862772802 : { 
            name : '天门', 
            province : 8627 
        }, 
        862772803 : { 
            name : '江汉', 
            province : 8627 
        }, 
        862882601 : { 
            name : '华蓥', 
            province : 8628 
        }, 
        862883201 : { 
            name : '内江', 
            province : 8628 
        }, 
        862883301 : { 
            name : '眉山', 
            province : 8628 
        }, 
        8631131101 : { 
            name : '辛集', 
            province : 86311 
        }, 
        8631131201 : { 
            name : '涿州', 
            province : 86311 
        }, 
        8631131202 : { 
            name : '定州', 
            province : 86311 
        }, 
        8631131601 : { 
            name : '霸州', 
            province : 86311 
        }, 
        8631131701 : { 
            name : '任丘', 
            province : 86311 
        }, 
        8631131702 : { 
            name : '泊头', 
            province : 86311 
        }, 
        8631131901 : { 
            name : '南宫', 
            province : 86311 
        }, 
        8631131902 : { 
            name : '沙河', 
            province : 86311 
        }, 
        8635135701 : { 
            name : '侯马', 
            province : 86351 
        }, 
        8637139801 : { 
            name : '义马', 
            province : 86371 
        }, 
        8643143201 : { 
            name : '公主岭', 
            province : 86431 
        }, 
        8643143202 : { 
            name : '桦甸', 
            province : 86431 
        }, 
        8643143301 : { 
            name : '延吉', 
            province : 86431 
        }, 
        8643143302 : { 
            name : '敦化市', 
            province : 86431 
        }, 
        8643143303 : { 
            name : '图们', 
            province : 86431 
        }, 
        8643143501 : { 
            name : '集安', 
            province : 86431 
        }, 
        8643143601 : { 
            name : '扶余', 
            province : 86431 
        }, 
        8643143602 : { 
            name : '洮南', 
            province : 86431 
        }, 
        8643143801 : { 
            name : '龙井', 
            province : 86431 
        }, 
        8645145101 : { 
            name : '肇东', 
            province : 86451 
        }, 
        8645145301 : { 
            name : '绥汾河', 
            province : 86451 
        }, 
        8645145401 : { 
            name : '同江', 
            province : 86451 
        }, 
        8645145601 : { 
            name : '五大连池', 
            province : 86451 
        }, 
        8645145602 : { 
            name : '北安', 
            province : 86451 
        }, 
        8647147001 : { 
            name : '扎兰屯', 
            province : 86471 
        }, 
        8647147002 : { 
            name : '牙克石', 
            province : 86471 
        }, 
        8647147003 : { 
            name : '满洲里', 
            province : 86471 
        }, 
        8647147501 : { 
            name : '霍林郭勒', 
            province : 86471 
        }, 
        8647147901 : { 
            name : '二连浩特', 
            province : 86471 
        }, 
        8653153601 : { 
            name : '青州', 
            province : 86531 
        }, 
        8653153602 : { 
            name : '诸城', 
            province : 86531 
        }, 
        8653153701 : { 
            name : '曲阜', 
            province : 86531 
        }, 
        8653153801 : { 
            name : '新泰', 
            province : 86531 
        }, 
        8653163101 : { 
            name : '文登', 
            province : 86531 
        }, 
        8653163201 : { 
            name : '滕州', 
            province : 86531 
        }, 
        8653163501 : { 
            name : '临清', 
            province : 86531 
        }, 
        8655155801 : { 
            name : '亳州', 
            province : 86551 
        }, 
        8657157001 : { 
            name : '江山', 
            province : 86571 
        }, 
        8657157101 : { 
            name : '萧山', 
            province : 86571 
        }, 
        8657157301 : { 
            name : '海宁', 
            province : 86571 
        }, 
        8657157401 : { 
            name : '奉化', 
            province : 86571 
        }, 
        8657157602 : { 
            name : '临海', 
            province : 86571 
        }, 
        8657157403 : { 
            name : '余姚', 
            province : 86571 
        }, 
        8657157601 : { 
            name : '椒江', 
            province : 86571 
        }, 
        8657157701 : { 
            name : '瑞安', 
            province : 86571 
        }, 
        8657157901 : { 
            name : '东阳', 
            province : 86571 
        }, 
        8657157902 : { 
            name : '义乌', 
            province : 86571 
        }, 
        8657157903 : { 
            name : '兰溪', 
            province : 86571 
        }, 
        8659159501 : { 
            name : '石狮', 
            province : 86591 
        }, 
        8659159801 : { 
            name : '永安', 
            province : 86591 
        }, 
        8659159901 : { 
            name : '邵武', 
            province : 86591 
        }, 
        8673173001 : { 
            name : '汨罗', 
            province : 86731 
        }, 
        8673173201 : { 
            name : '湘乡', 
            province : 86731 
        }, 
        8673173401 : { 
            name : '耒阳', 
            province : 86731 
        }, 
        8673173601 : { 
            name : '津市', 
            province : 86731 
        }, 
        8673173801 : { 
            name : '涟源', 
            province : 86731 
        }, 
        8673173802 : { 
            name : '冷水江', 
            province : 86731 
        }, 
        8673174501 : { 
            name : '洪江', 
            province : 86731 
        }, 
        8673174601 : { 
            name : '冷水滩', 
            province : 86731 
        }, 
        8677177001 : { 
            name : '东兴', 
            province : 86771 
        }, 
        8677177101 : { 
            name : '凭祥', 
            province : 86771 
        }, 
        8677177201 : { 
            name : '合山', 
            province : 86771 
        }, 
        8677177401 : { 
            name : '贺州', 
            province : 86771 
        }, 
        8677177501 : { 
            name : '贵港', 
            province : 86771 
        }, 
        8677177801 : { 
            name : '东兰', 
            province : 86771 
        }, 
        8679179201 : { 
            name : '庐山', 
            province : 86791 
        }, 
        8679179401 : { 
            name : '黎川', 
            province : 86791 
        }, 
        8679179601 : { 
            name : '井冈山', 
            province : 86791 
        }, 
        8685185201 : { 
            name : '赤水', 
            province : 86851 
        }, 
        8687187301 : { 
            name : '潞西', 
            province : 86871 
        }, 
        8687187302 : { 
            name : '开远', 
            province : 86871 
        }, 
        8689889801 : { 
            name : '通什', 
            province : 86898 
        }, 
        8693193401 : { 
            name : '西峰', 
            province : 86931 
        }, 
        8693193501 : { 
            name : '武威', 
            province : 86931 
        }, 
        8693193701 : { 
            name : '嘉峪关', 
            province : 86931 
        }, 
        8693193702 : { 
            name : '玉门', 
            province : 86931 
        }, 
        8695195201 : { 
            name : '青铜峡', 
            province : 86951 
        }
    };

    zone.provinces = provinces;
    zone.cities = cities;

    return zone;
});